spec/vcr/Spree_Order/_cancel_avalara/should_be_successful.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R103836575","DocDate":"2017-01-13","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #104 - 1008","TaxCode":"PC030000","ItemCode":"SKU-104","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"[Company]","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R103836575","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '800'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Jan 2017 16:31:05 GMT
      Content-Length:
      - '580'
      Set-Cookie:
      - TS017f1821=01a8ddc44e92bef925040eed7ec8811154d3d592a7f5ba6043d02bf1567e08b99690490d8fbd8d1f3cc91604c69ddc898dc7c0e20b;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2t25d3Dv0/sP7usXT7OWv9jb2X2wvbO7vXsPX7wpFnnTZotV+NWb
        3U8f3dt9tHN/fG9/d//g/k9x26rNyuNFtV62aL27Yz98WjRT87H79PRdvli1
        RbUMP36TvcsmJePigaBP8cnOeN//6CQrp+uSMJ/5X2bvnhfLvKGPvpcQOfDH
        i4r++mh3+/mZtjB0eHmyc2+HHv04mxRl0V7jm7Ze5/j0CWE+y+rr5/llXuKL
        nypWTLQ+/v1xAqI/lleEK/7aGe/sU6/8GTWSjwz2Q6N6mrdZUdpxnaCrmnH9
        6jWavMovFJvj5/j7O+u6aN5cr7jH1y0BtJ+a4e/s4iOC/b5oMpQX2YKbHT8/
        fnL8xTE+p1bu0/T1m+M3p+mb49/7o1+SfD/B/6XJ8WxWE0+6OdIP6M+PjtOn
        xfl5XufLNn1VZTNA1a8N1k+JJ/HxiU7VF9WyvagWOREDn3bp8rIiFi7Ny/c+
        3d3hIXTJRXjJR2dM972d+3sPHj7ENzxY8/7O7u7O7v1dUOWXJKMQ94e799PX
        6Xey6dumWqavGUn92rz+ZV1c4OOfe9zNZEQk/5ck/w9SeE6ERwQAAA==
    http_version:
  recorded_at: Fri, 13 Jan 2017 16:31:05 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R103836575","DocDate":"2017-01-13","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #104 - 1008","TaxCode":"PC030000","ItemCode":"SKU-104","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"[Company]","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R103836575","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1147'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Jan 2017 16:31:05 GMT
      Content-Length:
      - '674'
      Set-Cookie:
      - TS017f1821=01a8ddc44ef1d7aca59a5ad2c4a6183ca80976a71ec18d9b5b2d0034fc127ae485f453abb06fd8b92f263ff8d425a9c243b5c95649;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2t25d3Dv0/sP7usXT7OWv9jb2X2wvbO7vXsPX7wpFnnTZotV+NWb
        3U8f3dt9tPPp+P7Dh/f29x78FDeu2qw8XlTrZYvmuwyaP3xaNFPz8Y799PRd
        vli1RbUMP36TvcsmJSPjgaBP8cnO+FP/o5OsnK5LQn3mf5m9e14s84Y++l5C
        9MAfLyr666Pd7edn2sIQ4uXJzr0devTjbFKURXuNb9p6nePTJ4T5LKuvn+eX
        eYkvfqpYMV59/PvjBEQdC3/winDFXzvjnX3qlT+jRvLRvv7VHZX5/GneZkVp
        x3WCrmrG9avXaPIqv1Bsjp/j7++s66J5c73iHl+3BNB+aoa/s4uPCPb7oslQ
        XmQLbnb8/PjJ8RfH+JxauU/T12+O35ymb45/749+SfL95JckI0Lbn45nr/Qd
        g8+zV9QbPfrxz9508Csbh7mnf3Vnw3z+w5iNW2LJQBzZbzkZ30+kyfFsVpOG
        cAKjH9CfHx2nT4vz87zOl236qspmgKpfG6SfkobAxyc6UV9Uy/aiWuREC3za
        JcvLihRKaV6+9+nuDvNTl1qEl3x0xmTf27m/9+DhQ3zDgzXv7+zu7uze3wVV
        hLsUOXy3++nOTvoyXy6b6/IyWxZZenyZpy++CyDazIBhKpoBfDdr5sXyoiV0
        8OnmARBi1Dd9LNjio6cn+LszAG4ToE6Y60Oom7mIqOFfkvw/r+0vtNQFAAA=
    http_version:
  recorded_at: Fri, 13 Jan 2017 16:31:06 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R103836575","DocDate":"2017-01-13","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #104 - 1008","TaxCode":"PC030000","ItemCode":"SKU-104","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"[Company]","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R103836575","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1148'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Jan 2017 16:31:07 GMT
      Content-Length:
      - '667'
      Set-Cookie:
      - TS017f1821=01a8ddc44ea16f5f946f58ca48708143488298e536e97fe078e4a9df7013fa7830492117f57203f45d73a60317639118d0d0d70088;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2t25d3Dv0/sP7usXT7OWv9jb2X2wvbO7vXsPX7wpFnnTZotV+NWb
        3U8f3dt9tPNg/OCBtKvarDxeVOtli5a7DJU/fFo0U/Pxjv309F2+WLVFtQw/
        fpO9yyYl4+GBoE/xyc74U/+jk6ycrkvCeuZ/mb17Xizzhj76XkKkwB8vKvrr
        o93t52fawtDg5cnOvR169ONsUpRFe41v2nqd49MnhPksq6+f55d5iS9+qlgx
        Xn38++MERB0Lf/CKcMVfO+OdfeqVP6NG8tG+/tUdlfn8ad5mRWnHdYKuasb1
        q9do8iq/UGyOn+Pv76zronlzveIeX7cE0H5qhr+zi48I9vuiyVBeZAtudvz8
        +MnxF8f4nFq5T9PXb47fnKZvjn/vj35J8v3klyQjQtufjmev9B2Dz7NX1Bs9
        +vHP3nTwKxuHuad/dWfDfP7DmI1bYslAHNlvORnfT6TJ8WxWk3JwAqMf0J8f
        HadPi/PzvM6XbfqqymaAql8bpJ+ScsDHJzpRX1TL9qJa5EQLfNoly8uKdElp
        Xr736e4O81OXWoSXfHTGZN/bub/34OFDfMODNe/v7O7u7N7fBVWEuxQ5fLf7
        6c5O+jJfLpvr8jJbFll6fJmnL74LINrMgGEqmgF8N2vmxfKiJXTw6eYBEGLU
        N30s2OKjpyf4uzMAbhOgTpjrQ6ibuYho4F+S/D/LlrXAzwUAAA==
    http_version:
  recorded_at: Fri, 13 Jan 2017 16:31:07 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/cancel
    body:
      encoding: UTF-8
      string: '{"CompanyCode":"[Company]","DocType":"SalesInvoice","DocCode":"R103836575","CancelCode":"DocVoided"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '96'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Fri, 13 Jan 2017 16:31:08 GMT
      Content-Length:
      - '211'
      Set-Cookie:
      - TS017f1821=01a8ddc44ebbfbb5233911b7790b253add735ad7a69eca7d5ba1dc155281cabcf52cb83339af73f0cede65f59536de15ad0f58e6bf;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tFJtpzm5Zvs3au8WZftR49S+vBpNT2b
        0a8f7X366ae79+892P9olHz0ps6WTTZti2rJ397fuf/w4OHOpwcP6N97+7vU
        RICcVLOcvv/o9Xo6zZvmo1+S/JLk/wHstIZ2awAAAA==
    http_version:
  recorded_at: Fri, 13 Jan 2017 16:31:08 GMT
recorded_with: VCR 3.0.3
