spec/vcr/Spree_Payment/_cancel_avalara/committed_order/should_be_successful/ResultCode_returns_Success.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R755990424","DocDate":"2017-03-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #3 - 5161","TaxCode":"PC030000","ItemCode":"SKU-3","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R755990424","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '796'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 22 Mar 2017 18:47:39 GMT
      Content-Length:
      - '583'
      Set-Cookie:
      - TS017f1821=01a8ddc44e4576290b9967455f5a5a529f3ccb0324584fbbbf26aa2d17043f6d25769b935dbb6ad023f989ae1e5a7ae965e529d3db;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++enD//sOHO/t7+/rF06zlL/Z2dh9s79zb3tvDF2+KRd602WIVfvVm
        9+DR/oNH9x6O7z+4v7+//+CnuHHVZuXxolovWzTf3bEfPi2aqfnYfXr6Ll+s
        2qJahh+/yd5lk5KR8UDQp/hkZ8wIm49OsnK6Lgn1mf9l9u55scwb+uh7CdED
        f7yo6K+Pdrefn2kLQ4iXJzv3dujRj7NJURbtNb5p63WOT58Q5rOsvn6eX+Yl
        vvipYnUfX/Tx748TEP2xvCJc8dfOeGefeuXPqJF8ZLAfGtXTvM2K0o7rBF3V
        jOtXr9HkVX6h2Bw/x9/fWddF8+Z6xT2+bgmg/dQMf2cXHxHs90WTobzIFtzs
        +Pnxk+MvjvE5tXKfpq/fHL85Td8c/94f/ZLk+wn+L02OZ7OamNLNkX5Af350
        nD4tzs/zOl+26asqmwGqfm2wfkpMiY9PdKq+qJbtRbXIiRj4tEuXlxXxcGle
        vvfp7g4PoUsuwks+OmO67+3c33vw8CG+4cGa93d2d3d27++CKr8kGYW4P9y9
        n75Ov5NN3zbVMn3NSOrX5vUv6+ICH//c424mIyL6vyT5fwDGFYW0SAQAAA==
    http_version: 
  recorded_at: Wed, 22 Mar 2017 18:47:38 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R755990424","DocDate":"2017-03-22","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #3 - 5161","TaxCode":"PC030000","ItemCode":"SKU-3","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R755990424","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1143'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 22 Mar 2017 18:47:39 GMT
      Content-Length:
      - '675'
      Set-Cookie:
      - TS017f1821=01a8ddc44ef6b6b32bae147f7e203a4f5a434becf8025720830b6dec8d861a1ec5fd250e2a2070ccd54fdffd97eafef78c510975c1;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++enD//sOHO/t7+/rF06zlL/Z2dh9s79zb3tvDF2+KRd602WIVfvVm
        9+DR/oNH+zvj3U/v7z94eO+nuHHVZuXxolovWzTfvW8/fFo0U/Pxjv309F2+
        WLVFtQw/fpO9yyYlI+OBoE/xyc74U/+jk6ycrktCfeZ/mb17Xizzhj76XkL0
        wB8vKvrro93t52fawhDi5cnOvR169ONsUpRFe41v2nqd49MnhPksq6+f55d5
        iS9+qlgxXn38++MERB0Lf/CKcMVfO+OdfeqVP6NG8hHPBf3VHZX5/GneZkVp
        x3WCrmrG9avXaPIqv1Bsjp/j7++s66J5c73iHl+3BNB+aoa/s4uPCPb7oslQ
        XmQLbnb8/PjJ8RfH+JxauU/T12+O35ymb45/749+SfL95JckI0Lbn45nr/Qd
        g8+zV9QbPfrxz9508CsbhykCQKh1ZsN8/sOYjVtiyUAc2W85Gd9PpMnxbFaT
        hnACox/Qnx8dp0+L8/O8zpdt+qrKZoCqXxukn5KGwMcnOlFfVMv2olrkRAt8
        2iXLy4oUSmlevvfp7g7zU5dahJd8dMZk39u5v/fg4UN8w4M17+/s7u7s3t8F
        VYS7FDl8t/vpzk76Ml8um+vyMlsWWXp8macvvgsg2syAYSqaAXw3a+bF8qIl
        dPDp5gEQYtQ3fSzY4qOnJ/i7MwBuE6BOmOtDqJu5iKjhX5L8P7lcdmvUBQAA
    http_version: 
  recorded_at: Wed, 22 Mar 2017 18:47:39 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R755990424","DocDate":"2017-03-22","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #3 - 5161","TaxCode":"PC030000","ItemCode":"SKU-3","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R755990424","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1144'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 22 Mar 2017 18:47:40 GMT
      Content-Length:
      - '669'
      Set-Cookie:
      - TS017f1821=01a8ddc44e2804a0377afefa27e450c112b3c71e8c51fb1ea7aa18f7610589f2261db9b4fa0b7ab695f4e056796620d449b0502ea8;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++enD//sOHO/t7+/rF06zlL/Z2dh9s79zb3tvDF2+KRd602WIVfvVm
        9+DR/oNH+zvjg7173K5qs/J4Ua2XLVru3rcfPi2aqfl4x356+i5frNqiWoYf
        v8neZZOS8fBA0Kf4ZGf8qf/RSVZO1yVhPfO/zN49L5Z5Qx99LyFS4I8XFf31
        0e728zNtYWjw8mTn3g49+nE2KcqivcY3bb3O8ekTwnyW1dfP88u8xBc/VawY
        rz7+/XECoo6FP3hFuOKvnfHOPvXKn1Ej+Yingf7qjsp8/jRvs6K04zpBVzXj
        +tVrNHmVXyg2x8/x93fWddG8uV5xj69bAmg/NcPf2cVHBPt90WQoL7IFNzt+
        fvzk+ItjfE6t3Kfp6zfHb07TN8e/90e/JPl+8kuSEaHtT8ezV/qOwefZK+qN
        Hv34Z286+JWNwxTeJ9Q6s2E+/2HMxi2xZCCO7LecjO8n0uR4NqtJOTiB0Q/o
        z4+O06fF+Xle58s2fVVlM0DVrw3ST0k54OMTnagvqmV7US1yogU+7ZLlZUW6
        pDQv3/t0d4f5qUstwks+OmOy7+3c33vw8CG+4cGa93d2d3d27++CKsJdihy+
        2/10Zyd9mS+XzXV5mS2LLD2+zNMX3wUQbWbAMBXNAL6bNfNiedESOvh08wAI
        MeqbPhZs8dHTE/zdGQC3CVAnzPUh1M1cRDTwL0n+HwGKUCHPBQAA
    http_version: 
  recorded_at: Wed, 22 Mar 2017 18:47:39 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/cancel
    body:
      encoding: UTF-8
      string: '{"CompanyCode":"54321","DocType":"SalesInvoice","DocCode":"R755990424","CancelCode":"DocVoided"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '96'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Wed, 22 Mar 2017 18:47:40 GMT
      Content-Length:
      - '212'
      Set-Cookie:
      - TS017f1821=01a8ddc44e116747ab7aa2c98d5c63976e0598eca13cc61a12300105f5904d45c97c14e2a655a313845fb1b3a3ffa073ecf18a227e;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tFJtpzm5Zvs3au8WZftR49S+vBpNT2b
        0a8f7R3cu7/76YOH9z4aJR+9qbNlk03bolryt/d3dw8efLrz6e7evf2DvYcH
        1ESAnFSznL7/6PV6Os2b5qNfkvyS5P8BIw9F5WsAAAA=
    http_version: 
  recorded_at: Wed, 22 Mar 2017 18:47:40 GMT
recorded_with: VCR 3.0.3
