spec/vcr/Spree_Payment/_cancel_avalara/uncommitted_order/should_fail/ResultCode_returns_Error.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R338927200","DocDate":"2017-05-30","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #1 - 2850","TaxCode":"PC030000","ItemCode":"SKU-1","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R338927200","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '796'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 30 May 2017 19:13:45 GMT
      Content-Length:
      - '558'
      Set-Cookie:
      - TS017f1821=01a8ddc44e82d55901f2280be384e9ab88d5818ba4f7c9b80065341d265e4232df77eab6539cc4d9a3b1cb73b0f495384f165336aa;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++unfv4OHeg72dHf3iadbyF3s7uw+2d+5v3+Mv3hSLvGmzxSr86s3u
        w0e79x7tfzomAPsPHu79FDeu2qw8XlTrZYvmuwIBHz4tmqn52H16+i5frNqi
        WoYfv8neZZOSkfFA0Kf4ZGe87390kpXTdUmoz/wvs3fPi2Xe0EffS4ge+ONF
        RX99tLv9/ExbGEK8PNm5t0OPfpxNirJor/FNW69zfPqEMJ9l9fXz/DIv8cXx
        bFYrRftD6A8VQP3hvCJ08dfOeGefOubPqJF8ZAYwNLCneZsVpR3aCbqqGd2v
        XqPJq/xCsTl+jr+/s66L5s31int83RJA+6mhwM4uPiLY74smQ3mRLbjZ8fPj
        J8dfHONzauU+TV+/OX5zmr45/r0/+iXJ9xP8X5ooFd006Qf050cPd++nr9Pv
        ZNO3TbVMX7eAql8brJ8SX+LjE52tL6ple1EtciIGPu3S5WVFbFyal+99urvD
        Q+iSi/CSj86Y7ns79/cePHyIb3iw5v2d3d2d3fu7oMovSUbvjfuXdXGBj3/u
        cTeTEZH+X5L8P/SMCZxLBAAA
    http_version: 
  recorded_at: Tue, 30 May 2017 19:13:46 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R338927200","DocDate":"2017-05-30","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #1 - 2850","TaxCode":"PC030000","ItemCode":"SKU-1","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R338927200","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1143'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 30 May 2017 19:13:46 GMT
      Content-Length:
      - '672'
      Set-Cookie:
      - TS017f1821=01a8ddc44eccfd706d4b0360af0698a35051ed36ad8b5a29710985264bc1a37247700199f047db87f897280a12a1d0ecc8cbd5c585;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++unfv4OHeg72dHf3iadbyF3s7uw+2d+5v3+Mv3hSLvGmzxSr86s3u
        w0e79x7tfzo++HTv4c7D+z/Fjas2K48X1XrZovnuffvh06KZmo8FLj49fZcv
        Vm1RLcOP32TvsknJyHgg6FN8sjP+1P/oJCun65JQn/lfZu+eF8u8oY++lxA9
        8MeLiv76aHf7+Zm2MIR4ebJzb4ce/TibFGXRXuObtl7n+PQJYT7L6uvn+WVe
        4ovj2axWivaH0B8qgOpw+INXhC7+2hnv7FPH/Bk1ko/29a/uwMznT/M2K0o7
        tBN0VTO6X71Gk1f5hWJz/Bx/f2ddF82b6xX3+LolgPZTQ4GdXXxEsN8XTYby
        Iltws+Pnx0+OvzjG59TKfZq+fnP85jR9c/x7f/RLku8nvyQZEdr+jDx7pe8Y
        fJ69ot7o0Y9/VmeE+WvjSPf0r+6EmM9/GBNySywZiKP8Lefj+4k0URo6sdEP
        6M+PHu7eT1+n38mmb5tqmb5uAVW/Nkg/JT2Bj090rr6olu1FtciJFvi0S5aX
        FamV0rx879PdHWapLrUIL/nojMm+t3N/78HDh/iGB2ve39nd3dm9vwuqCIMp
        cvhu99OdnfRlvlw21+Vltiyy9PgyT198F0C0mQHDVDQD+G7WzIvlRUvo4NPN
        AyDEqG/6WLDFR09P8HdnAA/3+8gT7voQ8mY2Iur4lyT/D+XTu8bcBQAA
    http_version: 
  recorded_at: Tue, 30 May 2017 19:13:47 GMT
- request:
    method: post
    uri: https://sandbox-rest.avatax.com/api/v2/companies/54321/transactions/R338927200/void
    body:
      encoding: UTF-8
      string: '{"code":"DocVoided"}'
    headers:
      User-Agent:
      - Faraday v0.12.1
      Content-Type:
      - application/json
      Authorization:
      - Basic YWNyZWlsbHkzQGdtYWlsLmNvbTpUZXN0aW5nMTIz
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 404
      message: Not Found
    headers:
      Transfer-Encoding:
      - chunked
      Content-Type:
      - application/json; charset=utf-8
      Server:
      - Kestrel
      Serverduration:
      - '00:00:00.0074878'
      Databasecalls:
      - '4'
      Databaseduration:
      - '00:00:00.0074878'
      Date:
      - Tue, 30 May 2017 19:13:56 GMT
    body:
      encoding: UTF-8
      string: '{"error":{"code":"EntityNotFoundError","message":"Document with ID
        ''54321:R338927200'' not found.","target":"HttpRequest","details":[{"code":"EntityNotFoundError","number":4,"message":"Document
        with ID ''54321:R338927200'' not found.","faultCode":"Client","helpLink":"http://developer.avalara.com/avatax/errors/EntityNotFoundError","severity":"Error"}]}}'
    http_version: 
  recorded_at: Tue, 30 May 2017 19:13:57 GMT
recorded_with: VCR 3.0.3
